#+Title: Merge Experiment Results
#+Options: ^:{}

* Top-level Methodology
A simple experiment to collect information on frequency of different
types of conflicts from a small number of C/C++ programs which we can
easily uniformly build, our "benchmarks."

: conflicts-w-line-diff = ∅
: conflicts-w-line-diff-after-clang-format = ∅
: conflicts-w-AST-diff = ∅
: 
: ∀ b ∈ benchmarks
:   ∀ merge-commit ∈ 'git log --merges'
:     l := left-parent(merge-commit)
:     r := right-parent(merge-commit)
:     conflicts-w-line-diff := conflicts-w-line-diff ∪ {merge-commit,conflicts(l,r,'line)}
:     conflicts-w-line-diff-after-clang-format := conflicts-w-line-diff-after-clang-format ∪ {merge-commit,conflicts(format(l),format(r),'line)}
:     conflicts-w-AST-diff := conflicts-w-AST-diff ∪ {merge-commit,conflicts(l,r,'ast)}

We could then look at the above results for insight into different
classes of differences and merges, impact of differencing at AST
vs. line, impact of formatting, and if we re-run after adding new diff
operations it could yield insight into the impact of new diff
operations.

* Top-level Results
Evaluated 5295 merge conflicts from 27864 total merges across 26
popular open-source programs.  In a, currently, 174G directory
(=all-repos=).

#+begin_src shell
  total_commits(){
    local prog=$1;
    pushd $BENCHMARK_DIR/$prog >/dev/null
    git rev-list --all --count
    popd >/dev/null
  }

  merge_commits(){
    local prog=$1;
    grep $prog results/js-merges.txt|wc -l
  }

  merge_line_conflicts(){
    local prog=$1;
    grep $prog results/js-merges.txt|grep -Pc "\tconflict"
  }

  merge_diff3_conflicts(){
    local prog=$1;
    grep $prog results/js-stats.txt|awk 'BEGIN{count=0}{if($3 != 0){count++}}END{print count}'
  }

  diff3_column(){
    local prog=$1;
    local colu=$2;
    grep $prog results/js-stats.txt|awk "BEGIN{count=0}{if(\$$colu != 0){count++}}END{print count}"
  }

  for prog in $(cat results/js-merges.txt|awk '{print $1}'|sort|uniq);do
    echo -ne "$prog"
    echo -ne "\t$(total_commits $prog)"
    echo -ne "\t$(merge_commits $prog)"
    echo -ne "\t$(merge_line_conflicts $prog)"
    echo -ne "\t$(merge_diff3_conflicts $prog)"
    echo -ne "\t$(diff3_column $prog 5)"
    echo -ne "\t$(diff3_column $prog 6)"
    echo -ne "\t$(diff3_column $prog 7)"
    echo -ne "\t$(diff3_column $prog 8)"
    echo -ne "\t$(diff3_column $prog 9)"
    echo -ne "\t$(diff3_column $prog 10)"
    echo ""
  done
#+end_src

C/C++ results
| program             | commits | merge commits | merge line conflicts | merge line diff3 conflicts | % merge/commits | % conflict/merge | diff3/diff |
|---------------------+---------+---------------+----------------------+----------------------------+-----------------+------------------+------------|
| anope               |    6313 |           242 |                   26 |                         26 |       3.8333597 |        10.743802 |        100 |
| apache              |   47090 |            19 |                    2 |                          2 |     0.040348269 |        10.526316 |        100 |
| asterisk            |   62711 |          1715 |                    0 |                          0 |       2.7347674 |                0 |  (0/0) 100 |
| bind                |   52521 |           167 |                    2 |                          2 |      0.31796805 |        1.1976048 |        100 |
| bitcoin             |   17671 |          5528 |                   34 |                         32 |       31.282893 |       0.57887120 |  94.117647 |
| busybox             |   15793 |            14 |                    0 |                          0 |     0.088646869 |                0 |  (0/0) 100 |
| curl                |   23184 |            23 |                    0 |                          0 |     0.099206349 |                0 |  (0/0) 100 |
| dnsmasq             |    1319 |            29 |                    2 |                          2 |       2.1986353 |        6.8965517 |        100 |
| ffmpeg              |  109209 |          9187 |                 4755 |                       4755 |       8.4123103 |        51.757919 |        100 |
| ImageMagick         |   14366 |            33 |                    0 |                          0 |      0.22970904 |                0 |  (0/0) 100 |
| libzmq              |    6123 |          1955 |                   21 |                         20 |       31.928793 |        1.0230179 |  95.238095 |
| lighttpd            |    3947 |             9 |                    0 |                          0 |      0.22802128 |                0 |  (0/0) 100 |
| memcached           |    1888 |            11 |                    2 |                          2 |      0.58262712 |        18.181818 |        100 |
| monero              |    5132 |          1696 |                   12 |                         12 |       33.047545 |       0.70754717 |        100 |
| mosh                |    1372 |             6 |                    0 |                          0 |      0.43731778 |                0 |  (0/0) 100 |
| net-snmp            |   62719 |          2761 |                  244 |                        237 |       4.4021748 |        8.5838464 |  97.131148 |
| nginx               |    7317 |             5 |                    0 |                          0 |     0.068334017 |                0 |  (0/0) 100 |
| openssh             |    9111 |             1 |                    0 |                          0 |     0.010975744 |                0 |  (0/0) 100 |
| openvpn             |    2979 |            18 |                    7 |                          7 |      0.60422961 |        38.888889 |        100 |
| proftpd             |   11283 |           535 |                    4 |                          4 |       4.7416467 |       0.74766355 |        100 |
| samba               |  239048 |          1282 |                   53 |                         52 |      0.53629397 |        4.0561622 |  98.113208 |
| sqlite              |   18304 |          1215 |                   71 |                         70 |       6.6378934 |        5.7613169 |  98.591549 |
| squid               |   22977 |           900 |                   52 |                         52 |       3.9169604 |        5.7777778 |        100 |
| the_silver_searcher |    2010 |           433 |                    7 |                          7 |       21.542289 |        1.6166282 |        100 |
| unrealircd          |    6376 |            79 |                    1 |                          1 |       1.2390213 |        1.2658228 |        100 |
| wireshark           |   75732 |             1 |                    0 |                          0 |    1.3204458e-3 |                0 |  (0/0) 100 |
|---------------------+---------+---------------+----------------------+----------------------------+-----------------+------------------+------------|
| total/average       |  826495 |         27864 |                 5295 |                       5283 |       3.3713453 |        18.959948 |  99.773371 |
| max                 |  239048 |          9187 |                 4755 |                       4755 |       33.047545 |        51.757919 |        100 |
| min                 |    1319 |             1 |                    0 |                          0 |    1.3204458e-3 |                0 |  (0/0) 100 |
#+TBLFM: $6=($3/$2)*100::$7=($5/$3)*100::$8=($5/$4)*100::@28$2=vsum(@2..@-1)::@28$3=vsum(@2..@-1)::@28$5=vsum(@2..@-1)::@29$2=vmax(@2..@-2)::@29$3=vmax(@2..@-2)::@29$5=vmax(@2..@-2)::@29$6=vmax(@2..@-2)::@29$7=vmax(@2..@-2)::@30$2=vmin(@2..@-3)::@30$3=vmin(@2..@-3)::@30$5=vmin(@2..@-3)::@30$6=vmin(@2..@-3)::@30$7=vmin(@2..@-3)

JavaScript results
| program       | commits | merge commits | merge line conflicts | merge line diff3 conflicts | no-base | just-base | no-left | just-left | no-right | just-right | dropped-1 | added-1 | % merge/commits | % conflict/merge | diff3/diff |
|---------------+---------+---------------+----------------------+----------------------------+---------+-----------+---------+-----------+----------+------------+-----------+---------+-----------------+------------------+------------|
| async         |    1745 |           385 |                   11 |                         11 |       1 |         0 |       4 |         6 |        0 |          0 |         4 |       6 |       22.063037 |        1.5584416 |  54.545455 |
| axios         |     881 |           186 |                    7 |                          7 |       0 |         0 |       2 |         4 |        2 |          2 |         4 |       6 |       21.112372 |        3.2258065 |  85.714286 |
| bluebird      |    2493 |           217 |                    7 |                          7 |       0 |         0 |       1 |         5 |        1 |          3 |         2 |       8 |       8.7043722 |        3.6866359 |  114.28571 |
| body-parser   |     453 |             1 |                    0 |                          0 |       0 |         0 |       0 |         0 |        0 |          0 |         0 |       0 |      0.22075055 |                0 |  (0/0) 100 |
| chalk         |     267 |            21 |                    0 |                          0 |       0 |         0 |       0 |         0 |        0 |          0 |         0 |       0 |       7.8651685 |                0 |  (0/0) 100 |
| classnames    |     244 |            51 |                    1 |                          1 |       0 |         0 |       0 |         0 |        0 |          0 |         0 |       0 |       20.901639 |                0 |          0 |
| colors.js     |     249 |            44 |                    2 |                          2 |       0 |         0 |       0 |         1 |        0 |          1 |         0 |       2 |       17.670683 |        4.5454545 |        100 |
| commander.js  |     658 |           176 |                    2 |                          2 |       1 |         0 |       0 |         1 |        0 |          0 |         0 |       1 |       26.747720 |       0.56818182 |        50. |
| express       |    5783 |           458 |                   18 |                         17 |       2 |         0 |       8 |        10 |        3 |          6 |        11 |      16 |       7.9197648 |        3.4934498 |  88.888889 |
| generator     |    1222 |           250 |                    1 |                          1 |       0 |         0 |       0 |         0 |        0 |          0 |         0 |       0 |       20.458265 |                0 |          0 |
| minimist      |      73 |             1 |                    0 |                          0 |       0 |         0 |       0 |         0 |        0 |          0 |         0 |       0 |       1.3698630 |                0 |  (0/0) 100 |
| moment        |    3781 |           963 |                   35 |                         33 |       6 |         0 |      11 |        24 |        4 |         15 |        15 |      39 |       25.469453 |        4.0498442 |  111.42857 |
| node-fs-extra |    1028 |           143 |                    0 |                          0 |       0 |         0 |       0 |         0 |        0 |          0 |         0 |       0 |       13.910506 |                0 |  (0/0) 100 |
| node-glob     |     479 |             5 |                    0 |                          0 |       0 |         0 |       0 |         0 |        0 |          0 |         0 |       0 |       1.0438413 |                0 |  (0/0) 100 |
| node-uuid     |     362 |            51 |                    1 |                          1 |       0 |         0 |       0 |         0 |        0 |          0 |         0 |       0 |       14.088398 |                0 |          0 |
| prop-types    |     139 |            17 |                    1 |                          1 |       0 |         0 |       1 |         1 |        0 |          0 |         1 |       1 |       12.230216 |        5.8823529 |        100 |
| request       |    2285 |           680 |                   13 |                         13 |       0 |         0 |       1 |         2 |        0 |          4 |         1 |       6 |       29.759300 |       0.88235294 |  46.153846 |
| rxjs          |    4059 |           378 |                    9 |                          8 |       1 |         0 |       2 |         6 |        0 |          3 |         2 |       9 |       9.3126386 |        2.3809524 |        100 |
| through2      |     122 |            15 |                    1 |                          1 |       0 |         0 |       1 |         0 |        0 |          0 |         1 |       0 |       12.295082 |                0 |          0 |
| tslib         |     123 |            28 |                    4 |                          4 |       0 |         0 |       0 |         0 |        0 |          0 |         0 |       0 |       22.764228 |                0 |          0 |
| underscore    |    2516 |           745 |                   10 |                          9 |       0 |         0 |       2 |         3 |        0 |          1 |         2 |       4 |       29.610493 |       0.53691275 |        40. |
| yargs         |    1490 |           234 |                    3 |                          3 |       0 |         0 |       1 |         2 |        0 |          3 |         1 |       5 |       15.704698 |        2.1367521 |  166.66667 |
|---------------+---------+---------------+----------------------+----------------------------+---------+-----------+---------+-----------+----------+------------+-----------+---------+-----------------+------------------+------------|
| total/average |   30452 |          5049 |                  126 |                        121 |      11 |         0 |      34 |        65 |       10 |         38 |        44 |     103 |       16.580192 |        2.0400079 |  81.746032 |
| max           |    5783 |           963 |                 4755 |                         33 |       6 |         0 |      11 |        24 |        4 |         15 |        15 |      39 |         29.7593 |        5.8823529 | 0.82018927 |
| min           |      73 |             1 |                    0 |                          0 |       0 |         0 |       0 |         0 |        0 |          0 |         0 |       0 |      0.22075055 |                0 |  (0/0) 100 |
#+TBLFM: $12=$8+$10::$13=$9+$11::$14=($3/$2)*100::$15=($13/$3)*100::$16=($13/$4)*100::@24$2=vsum(@2..@-1)::@24$3=vsum(@2..@-1)::@24$4=vsum(@2..@-1)::@24$6=vsum(@2..@-1)::@24$7=vsum(@2..@-1)::@24$8=vsum(@2..@-1)::@24$9=vsum(@2..@-1)::@24$10=vsum(@2..@-1)::@24$11=vsum(@2..@-1)::@25$2=vmax(@2..@-2)::@25$3=vmax(@2..@-2)::@25$6=vmax(@2..@-2)::@25$7=vmax(@2..@-2)::@25$8=vmax(@2..@-2)::@25$9=vmax(@2..@-2)::@25$10=vmax(@2..@-2)::@25$11=vmax(@2..@-2)::@25$12=vmax(@2..@-2)::@25$14=vmax(@2..@-2)::@25$15=vmax(@2..@-2)::@26$2=vmin(@2..@-3)::@26$3=vmin(@2..@-3)::@26$6=vmin(@2..@-3)::@26$7=vmin(@2..@-3)::@26$8=vmin(@2..@-3)::@26$9=vmin(@2..@-3)::@26$10=vmin(@2..@-3)::@26$11=vmin(@2..@-3)::@26$12=vmin(@2..@-3)::@26$14=vmin(@2..@-3)::@26$15=vmin(@2..@-3)

The types of files with conflicts are predominantly C/C++.  5485/7943
(69.05%) Just with c, h, and cpp.  (From [[#type-of-files-w-conflicts][Types of files that have
conflicts]].)

| Count | Extension | What is this?                              |
|-------+-----------+--------------------------------------------|
|  3863 | c         | C/C++ source                               |
|  1148 | h         | C/C++ source                               |
|   361 | cpp       | C/C++ source                               |
|   322 | in        | autoconf                                   |
|   171 | def       | library descriptions and man pages (groff) |
|   166 | html      | html, docs                                 |
|   135 | pm        | perl, often under t/lib for tests          |
|   120 | configure | shell                                      |
|   120 | depend    | lines of dependency info, 'make depend'    |
|   119 | 3         |                                            |
|    89 | 1         |                                            |
|    84 | dsp       | MS developer studio generated build file   |
|    79 | cc        | C/C++ source                               |
|    76 | 8         |                                            |
|    73 | conf      | conf source *or* C/C++ source              |
|    65 | sgml      | standard generalized markup language, docs |
|    56 | xs        | C/C++                                      |
|    54 | txt       | Text                                       |
|    40 | po        | locale/language/i18n                       |
|    38 | mk        | Makefile                                   |
|    32 | sh        | shell                                      |
|    31 | props     | (couldn't find any)                        |
|    29 | Makefile  | Makefile                                   |
|    28 | PL        | Perl                                       |
|    27 | README    | Text                                       |
|    25 | am        | automake                                   |
|    22 | ac        | autoconf                                   |
|    20 | FAQ       | Text                                       |
|    20 | spec      | Linux package info, e.g. module deps       |

* Calculations
** Total programs
#+name: total-programs
#+begin_src shell
cat results/cc-merges.txt|awk '{print $1}'|sort|uniq|wc -l
#+end_src

#+RESULTS: total-programs
: 26

** Total commits
: git rev-list --all --count

** Total merges
#+name: total-merges
#+begin_src shell
cat results/cc-merges.txt|wc -l
#+end_src

#+RESULTS: total-merges
: 27864

** Total line conflicts
#+name: total-line-conflicts
#+begin_src shell
grep -Pc "\tconflict" results/cc-merges.txt
#+end_src

#+RESULTS: total-line-conflicts
: 5295
** Builds in every version
Try to build a compilation database for every version of every program.
Using this docker image docker.grammatech.com/synthesis/sel/ubuntu-sbcl:master.

Launch the docker image (so we have =bear= available) with needed directories.
#+begin_src sh :eval never
  docker run -it \
         -v $(pwd)/../benchmark:/benchmark \
         -v $(pwd):/merge-experiment \
         docker.grammatech.com/synthesis/sel/ubuntu-sbcl:master
#+end_src

Inside the image run try-cdbs to collect all compilation databases
that build.

*** Failed
| Repository          | failed | total |  failed-% |
|---------------------+--------+-------+-----------|
| filezilla           |     29 |    29 |       100 |
| pks                 |      0 |     5 |         0 |
| netqmail            |      0 |    10 |         0 |
| sipswitch           |     16 |    16 |       100 |
| apache              |  47072 | 47090 | 99.961775 |
| dnsmasq             |    141 |  1319 | 10.689917 |
| memcached           |   1051 |  1888 | 55.667373 |
| mosh                |   1372 |  1372 |       100 |
| redis               |      0 |    12 |         0 |
| sed                 |    618 |   618 |       100 |
| sendmail            |      0 |    12 |         0 |
| snort               |      0 |    16 |         0 |
| the_silver_searcher |   2010 |  2010 |       100 |
| zlib                |     49 |   424 | 11.556604 |
| file                |   1433 |  4750 | 30.168421 |
| nginx               |   4585 |  7317 | 62.662293 |
| lighttpd            |   3007 |  3947 | 76.184444 |
#+TBLFM: $4=($2/$3)*100

** DONE Diff3 statistics
   CLOSED: [2019-03-11 Mon 11:43]
Ran =diff3= with the following.
#+begin_src shell :eval never
  cat results/cc-merges.txt|grep -v "no-conflict"|cut -f 1,3,4,5|try-all-merges -l -w all-repos ../benchmark -- -m 2>try-diff3.stderr |tee try-diff3.stdout
#+end_src

Build the cc-stats.txt file with the following.
#+begin_src shell :eval never
  ./bin/cc-stats all-repos/*-*-*-*/ |tee cc-stats.txt
#+end_src

*** How good is diff3 at resolving merge conflicts

#+begin_src shell
cat try-diff3.stats|cla mean median min max
#+end_src

#+RESULTS:
|        | Success | Conflict |     Error | No-base | No-left | No-right |
|--------+---------+----------+-----------+---------+---------+----------|
| mean   | 796.797 |  12.4598 | 0.0440945 | 548.808 | 84.1559 |   1.1622 |
| median |     198 |        1 |         0 |      48 |       8 |        0 |
| min    |       0 |        0 |         0 |       0 |       0 |        0 |
| max    |    3763 |      461 |         7 |    3040 |     682 |      443 |

*** Types of files that have conflicts
    :PROPERTIES:
    :CUSTOM_ID: type-of-files-w-conflicts
    :END:
First, how many total files have conflicts?
#+begin_src shell :eval never
  find all-repos/*-*-*-* -name "*.1"|sed 's/\.diff3-patch\.1//;s/^.*\.//'|sort|wc -l
#+end_src

: 7943

Next, what types are they?
#+begin_src shell :eval never
  find all-repos/*-*-*-* -name "*.1"|xargs -I{} basename {}|sed 's/\.diff3-patch\.1//;s/^.*\.//'|sort|uniq -c|sort -n
#+end_src

They are predominantly C/C++.
5350/7943 (67.35%) Just with c, h, and cpp.

| Count | Extension | What is this?                              |
|-------+-----------+--------------------------------------------|
|  3863 | c         | C/C++ source                               |
|  1148 | h         | C/C++ source                               |
|   361 | cpp       | C/C++ source                               |
|   322 | in        | autoconf                                   |
|   171 | def       | library descriptions and man pages (groff) |
|   166 | html      | html, docs                                 |
|   135 | pm        | perl, often under t/lib for tests          |
|   120 | configure | shell                                      |
|   120 | depend    | lines of dependency info, 'make depend'    |
|   119 | 3         |                                            |
|    89 | 1         |                                            |
|    84 | dsp       | MS developer studio generated build file   |
|    79 | cc        | C/C++ source                               |
|    76 | 8         |                                            |
|    73 | conf      | conf source *or* C/C++ source              |
|    65 | sgml      | standard generalized markup language, docs |
|    56 | xs        | C/C++                                      |
|    54 | txt       | Text                                       |
|    40 | po        | locale/language/i18n                       |
|    38 | mk        | Makefile                                   |
|    32 | sh        | shell                                      |
|    31 | props     | (couldn't find any)                        |
|    29 | Makefile  | Makefile                                   |
|    28 | PL        | Perl                                       |
|    27 | README    | Text                                       |
|    25 | am        | automake                                   |
|    22 | ac        | autoconf                                   |
|    20 | FAQ       | Text                                       |
|    20 | spec      | Linux package info, e.g. module deps       |
|    18 | 5         |                                            |
|    15 | m2c       |                                            |
|    15 | pl        |                                            |
|    15 | win32     |                                            |
|    14 | NEWS      |                                            |
|    14 | top       |                                            |
|    14 | xml       |                                            |
|    13 | ChangeLog |                                            |
|    13 | gitignore |                                            |
|    13 | pdf       |                                            |
|    13 | RUNTESTS  |                                            |
|    12 | CHANGES   |                                            |
|    10 | m4        |                                            |

More popular filename with =.in=.  For a useful introduction/review of
automake and these =.in= files see:
- https://stackoverflow.com/questions/26832264/confused-about-configure-script-and-makefile-in/26832773#26832773
- https://thoughtbot.com/blog/the-magic-behind-configure-make-make-install
| count | filename                     |
|-------+------------------------------|
|   805 | Makefile.in                  |
|    60 | configure.in                 |
|    34 | root.db.in                   |
|    33 | example.db.in                |
|    26 | config.h.in                  |
|    15 | prereq.sh.in                 |
|    13 | stamp-h.in                   |
|    12 | named.conf.in                |
|     9 | platform.h.in                |
|     6 | autodefs.h.in                |
|     6 | child.db.in                  |
|     6 | conf.sh.in                   |
|     6 | dlv.db.in                    |
|     6 | dst.example.db.in            |
|     6 | netdb.h.in                   |
|     6 | nsec3.example.db.in          |
|     6 | nsec3.nsec3.example.db.in    |
|     6 | nsec3.optout.example.db.in   |
|     6 | optout.example.db.in         |
|     6 | optout.nsec3.example.db.in   |
|     6 | optout.optout.example.db.in  |
|     6 | private.secure.example.db.in |
|     6 | rsasha256.example.db.in      |
|     6 | rsasha512.example.db.in      |
|     6 | rules.in                     |
|     6 | secure.example.db.in         |
|     6 | secure.nsec3.example.db.in   |
|     6 | secure.optout.example.db.in  |
|     6 | settings.in                  |
|     6 | signed.db.in                 |

** TODO ast-merge statistics
Run with:
: try-merge -l -w all-repos/ -d ast-merge-or-diff3 ../benchmark/sqlite c0a327bf861f968b49fb68bffd79101973513809 8ebb3ba a0866cb

Looks like it found many fewer resolutions than your standard diff3
(or at least it returned ERRNO 1 very frequently).
: [root@a64464f26618 merge-experiment]# find /merge-experiment/all-repos/sqlite-c0a327bf861f968b49fb68bffd79101973513809-8ebb3ba-a0866cb/ -name "*ast-merge-or-diff3-patch*"
: /merge-experiment/all-repos/sqlite-c0a327bf861f968b49fb68bffd79101973513809-8ebb3ba-a0866cb/src/vdbe.c.ast-merge-or-diff3-patch.1
: /merge-experiment/all-repos/sqlite-c0a327bf861f968b49fb68bffd79101973513809-8ebb3ba-a0866cb/src/vdbeaux.c.ast-merge-or-diff3-patch.1
: /merge-experiment/all-repos/sqlite-c0a327bf861f968b49fb68bffd79101973513809-8ebb3ba-a0866cb/src/sqlite.h.in.ast-merge-or-diff3-patch.0
: /merge-experiment/all-repos/sqlite-c0a327bf861f968b49fb68bffd79101973513809-8ebb3ba-a0866cb/src/fkey.c.ast-merge-or-diff3-patch.1
: /merge-experiment/all-repos/sqlite-c0a327bf861f968b49fb68bffd79101973513809-8ebb3ba-a0866cb/src/test_malloc.c.ast-merge-or-diff3-patch.1
: /merge-experiment/all-repos/sqlite-c0a327bf861f968b49fb68bffd79101973513809-8ebb3ba-a0866cb/src/pragma.c.ast-merge-or-diff3-patch.1
: /merge-experiment/all-repos/sqlite-c0a327bf861f968b49fb68bffd79101973513809-8ebb3ba-a0866cb/src/status.c.ast-merge-or-diff3-patch.1                                                               /merge-experiment/all-repos/sqlite-c0a327bf861f968b49fb68bffd79101973513809-8ebb3ba-a0866cb/src/sqliteInt.h.ast-merge-or-diff3-patch.1
: /merge-experiment/all-repos/sqlite-c0a327bf861f968b49fb68bffd79101973513809-8ebb3ba-a0866cb/src/vdbeInt.h.ast-merge-or-diff3-patch.1
: /merge-experiment/all-repos/sqlite-c0a327bf861f968b49fb68bffd79101973513809-8ebb3ba-a0866cb/src/main.c.ast-merge-or-diff3-patch.1
: /merge-experiment/all-repos/sqlite-c0a327bf861f968b49fb68bffd79101973513809-8ebb3ba-a0866cb/src/vdbeapi.c.ast-merge-or-diff3-patch.1
: /merge-experiment/all-repos/sqlite-c0a327bf861f968b49fb68bffd79101973513809-8ebb3ba-a0866cb/test/fkey1.test.ast-merge-or-diff3-patch.0

* Notes
** Diff3 run time
After about a day we're more than half way through running the diff3
conflict collection.

This is the latest line processed after ~1 day of runtime.
: 13:12 mistletoe:merge-experiment grep -n bc5c4e99480320250 results/cc-merges.txt
: 18244:net-snmp  conflict        7bc5c4e99480320250e4de314c36d82a86372ae6        42b96ac c55f86f
: 13:13 mistletoe:merge-experiment wc -l results/cc-merges.txt
: 27864 results/cc-merges.txt

Which is 18244/27864 \approx 65.5% of the way through.
